app/controllers/users_controller.rb

  def show_all
    @users = User.all
---
SELECT * FROM `users`

  def add
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`imie`, `nazwisko`, `wiek`, `created_at`, `updated_at`, `wzrost`) VALUES('Marek', 'Stawowy', 20, '2010-03-04 19:05:25', '2010-03-04 19:05:25', 186)

  def delete
    @user = User.find(params[:id])
    @user.delete
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE (`id` IN (1))

  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 28)
UPDATE `users` SET `nazwisko` = 'asasdasdasdasd', `updated_at` = '2010-03-16 20:30:02' WHERE `id` = 33